app/controllers/gossip_page_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def show
    id_gossip = params[:id].to_i
    @gossip = Gossip.all[id_gossip]

SELECT "users".* FROM "users"
---
  def author
    id_author = params[:id].to_i
    @user = User.all[id_author]